{"format": "layers-model", "generatedBy": "keras v2.13.1", "convertedBy": "TensorFlow.js Converter v4.12.0", "modelTopology": {"keras_version": "2.13.1", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1314", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1314", "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1312", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1312", "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1315", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1315", "inbound_nodes": [[["conv2d_1314", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1311", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1311", "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1313", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1313", "inbound_nodes": [[["conv2d_1312", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1316", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1316", "inbound_nodes": [[["conv2d_1315", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_186", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_186", "inbound_nodes": [[["conv2d_1311", 0, 0, {}], ["conv2d_1313", 0, 0, {}], ["conv2d_1316", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1317", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1317", "inbound_nodes": [[["concatenate_186", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_174", "trainable": true, "dtype": "float32"}, "name": "add_174", "inbound_nodes": [[["conv2d_1317", 0, 0, {}], ["dense_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1321", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1321", "inbound_nodes": [[["add_174", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1319", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1319", "inbound_nodes": [[["add_174", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1322", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1322", "inbound_nodes": [[["conv2d_1321", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1318", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1318", "inbound_nodes": [[["add_174", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1320", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1320", "inbound_nodes": [[["conv2d_1319", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1323", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1323", "inbound_nodes": [[["conv2d_1322", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_187", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_187", "inbound_nodes": [[["conv2d_1318", 0, 0, {}], ["conv2d_1320", 0, 0, {}], ["conv2d_1323", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1324", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1324", "inbound_nodes": [[["concatenate_187", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_175", "trainable": true, "dtype": "float32"}, "name": "add_175", "inbound_nodes": [[["conv2d_1324", 0, 0, {}], ["add_174", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1325", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1325", "inbound_nodes": [[["add_175", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_23", "trainable": true, "dtype": "float32", "target_shape": [32, 32, 48]}, "name": "reshape_23", "inbound_nodes": [[["conv2d_1325", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1329", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1329", "inbound_nodes": [[["reshape_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1327", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1327", "inbound_nodes": [[["reshape_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1330", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1330", "inbound_nodes": [[["conv2d_1329", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1326", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1326", "inbound_nodes": [[["reshape_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1328", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1328", "inbound_nodes": [[["conv2d_1327", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1331", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1331", "inbound_nodes": [[["conv2d_1330", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_188", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_188", "inbound_nodes": [[["conv2d_1326", 0, 0, {}], ["conv2d_1328", 0, 0, {}], ["conv2d_1331", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1332", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1332", "inbound_nodes": [[["concatenate_188", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_176", "trainable": true, "dtype": "float32"}, "name": "add_176", "inbound_nodes": [[["conv2d_1332", 0, 0, {}], ["reshape_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1336", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1336", "inbound_nodes": [[["add_176", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1334", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1334", "inbound_nodes": [[["add_176", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1337", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1337", "inbound_nodes": [[["conv2d_1336", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1333", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1333", "inbound_nodes": [[["add_176", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1335", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1335", "inbound_nodes": [[["conv2d_1334", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1338", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1338", "inbound_nodes": [[["conv2d_1337", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_189", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_189", "inbound_nodes": [[["conv2d_1333", 0, 0, {}], ["conv2d_1335", 0, 0, {}], ["conv2d_1338", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1339", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1339", "inbound_nodes": [[["concatenate_189", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_177", "trainable": true, "dtype": "float32"}, "name": "add_177", "inbound_nodes": [[["conv2d_1339", 0, 0, {}], ["add_176", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1340", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1340", "inbound_nodes": [[["add_177", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1344", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1344", "inbound_nodes": [[["conv2d_1340", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1342", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1342", "inbound_nodes": [[["conv2d_1340", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1345", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1345", "inbound_nodes": [[["conv2d_1344", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1341", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1341", "inbound_nodes": [[["conv2d_1340", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1343", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1343", "inbound_nodes": [[["conv2d_1342", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1346", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1346", "inbound_nodes": [[["conv2d_1345", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_190", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_190", "inbound_nodes": [[["conv2d_1341", 0, 0, {}], ["conv2d_1343", 0, 0, {}], ["conv2d_1346", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1347", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1347", "inbound_nodes": [[["concatenate_190", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_178", "trainable": true, "dtype": "float32"}, "name": "add_178", "inbound_nodes": [[["conv2d_1347", 0, 0, {}], ["conv2d_1340", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1351", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1351", "inbound_nodes": [[["add_178", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1349", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1349", "inbound_nodes": [[["add_178", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1352", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1352", "inbound_nodes": [[["conv2d_1351", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1348", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1348", "inbound_nodes": [[["add_178", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1350", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1350", "inbound_nodes": [[["conv2d_1349", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1353", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1353", "inbound_nodes": [[["conv2d_1352", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_191", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_191", "inbound_nodes": [[["conv2d_1348", 0, 0, {}], ["conv2d_1350", 0, 0, {}], ["conv2d_1353", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1354", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1354", "inbound_nodes": [[["concatenate_191", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_179", "trainable": true, "dtype": "float32"}, "name": "add_179", "inbound_nodes": [[["conv2d_1354", 0, 0, {}], ["add_178", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1355", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1355", "inbound_nodes": [[["add_179", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_1355", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_1311/kernel", "shape": [1, 1, 8, 32], "dtype": "float32"}, {"name": "conv2d_1311/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1312/kernel", "shape": [1, 1, 8, 32], "dtype": "float32"}, {"name": "conv2d_1312/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1313/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1313/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1314/kernel", "shape": [1, 1, 8, 32], "dtype": "float32"}, {"name": "conv2d_1314/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1315/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1315/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1316/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1316/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1317/kernel", "shape": [1, 1, 96, 1], "dtype": "float32"}, {"name": "conv2d_1317/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_1318/kernel", "shape": [1, 1, 8, 32], "dtype": "float32"}, {"name": "conv2d_1318/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1319/kernel", "shape": [1, 1, 8, 32], "dtype": "float32"}, {"name": "conv2d_1319/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1320/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1320/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1321/kernel", "shape": [1, 1, 8, 32], "dtype": "float32"}, {"name": "conv2d_1321/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1322/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1322/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1323/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1323/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1324/kernel", "shape": [1, 1, 96, 1], "dtype": "float32"}, {"name": "conv2d_1324/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_1325/kernel", "shape": [1, 1, 8, 3], "dtype": "float32"}, {"name": "conv2d_1325/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_1326/kernel", "shape": [1, 1, 48, 32], "dtype": "float32"}, {"name": "conv2d_1326/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1327/kernel", "shape": [1, 1, 48, 32], "dtype": "float32"}, {"name": "conv2d_1327/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1328/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1328/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1329/kernel", "shape": [1, 1, 48, 32], "dtype": "float32"}, {"name": "conv2d_1329/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1330/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1330/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1331/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1331/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1332/kernel", "shape": [1, 1, 96, 1], "dtype": "float32"}, {"name": "conv2d_1332/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_1333/kernel", "shape": [1, 1, 48, 32], "dtype": "float32"}, {"name": "conv2d_1333/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1334/kernel", "shape": [1, 1, 48, 32], "dtype": "float32"}, {"name": "conv2d_1334/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1335/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1335/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1336/kernel", "shape": [1, 1, 48, 32], "dtype": "float32"}, {"name": "conv2d_1336/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1337/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1337/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1338/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1338/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1339/kernel", "shape": [1, 1, 96, 1], "dtype": "float32"}, {"name": "conv2d_1339/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_1340/kernel", "shape": [1, 1, 48, 24], "dtype": "float32"}, {"name": "conv2d_1340/bias", "shape": [24], "dtype": "float32"}, {"name": "conv2d_1341/kernel", "shape": [1, 1, 24, 32], "dtype": "float32"}, {"name": "conv2d_1341/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1342/kernel", "shape": [1, 1, 24, 32], "dtype": "float32"}, {"name": "conv2d_1342/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1343/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1343/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1344/kernel", "shape": [1, 1, 24, 32], "dtype": "float32"}, {"name": "conv2d_1344/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1345/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1345/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1346/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1346/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1347/kernel", "shape": [1, 1, 96, 1], "dtype": "float32"}, {"name": "conv2d_1347/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_1348/kernel", "shape": [1, 1, 24, 32], "dtype": "float32"}, {"name": "conv2d_1348/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1349/kernel", "shape": [1, 1, 24, 32], "dtype": "float32"}, {"name": "conv2d_1349/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1350/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1350/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1351/kernel", "shape": [1, 1, 24, 32], "dtype": "float32"}, {"name": "conv2d_1351/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1352/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1352/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1353/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1353/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1354/kernel", "shape": [1, 1, 96, 1], "dtype": "float32"}, {"name": "conv2d_1354/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_1355/kernel", "shape": [1, 1, 24, 1], "dtype": "float32"}, {"name": "conv2d_1355/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_11/kernel", "shape": [3, 8], "dtype": "float32"}, {"name": "dense_11/bias", "shape": [8], "dtype": "float32"}]}]}